{
    "title": "PHP – history, environment setup, and first program",
    "description": "Learn the history of PHP and set up a development environment. Discover how to install XAMPP and write your first Hello World program in PHP.",
    "slug": "before-programming-in-php",
    "position": 1,
    "full_description": "<h1>PHP – history, environment setup, and first program</h1><p>PHP is one of the most popular programming languages used for creating dynamic websites. In this chapter, you will learn where PHP came from, how it began, and how to prepare your environment for learning and development.</p><h2>A brief history of PHP</h2><p>The first version of PHP was created in <strong>1994</strong> by Rasmus Lerdorf as a simple set of CGI tools. Over time, PHP evolved into a fully-fledged programming language with a huge community and support for modern web applications.</p><h2>Setting up the environment</h2><p>To start programming in PHP, you need a few components:</p><ul><li><strong>Web Server</strong> – e.g., Apache</li><li><strong>PHP Interpreter</strong> – allows you to run code</li><li><strong>Database</strong> – usually MySQL or MariaDB</li><li><strong>Editor/IDE</strong> – e.g., VS Code, PhpStorm</li></ul><p>The simplest solution for beginners is the <strong>XAMPP</strong> package, which installs Apache, PHP, and MySQL in a single environment.</p><h2>Installing XAMPP</h2><ol><li>Download the installer from the official <a href=\"https://www.apachefriends.org/pl/index.html\" target=\"_blank\" rel=\"noopener\">Apache Friends</a> website.</li><li>Install the package and run the XAMPP control panel.</li><li>Enable the Apache and MySQL modules.</li></ol><p>Once the server is running, you can place PHP files in the <code>htdocs</code> directory.</p><h2>Your first PHP program – Hello World</h2><p>Create a file named <code>index.php</code> in the <code>htdocs</code> directory and paste the following code:</p><pre><code class=\"language-php\">&lt;?php\necho \"Hello World!\";\n</code></pre><p>Then, in your browser, type the address: <code>http://localhost/index.php</code>. You should see the message <strong>Hello World!</strong>.</p><h2>Good practices to start with</h2><ul><li>Use an editor with syntax highlighting.</li><li>Keep your code clear – use indentation and comments.</li><li>Learn the syntax step by step instead of jumping straight into frameworks.</li></ul><section class=\"faq\"><h2>FAQ</h2><h3>Do I have to install XAMPP to learn PHP?</h3><p>No, you can use other packages (e.g., Laragon, MAMP) or Docker. However, XAMPP is the simplest for beginners.</p><h3>Can I write PHP on Windows, Mac, and Linux?</h3><p>Yes, PHP works on all popular operating systems. The installation differs only in details.</p></section>"
}
